---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailureMessageKey
source: html/b83da88c-6508-3295-ec60-937974898005.htm
---
# FailureMessageKey Properties

Specifies whether the .NET object represents a valid Revit entity.